<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">
<head>
<title>Nathan Valentin</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="Content-Language" content="fr" />
<link href="../style.css" rel="stylesheet" type="text/css" />
</head>

<body>
	<div id="nomgroupe">
    	<h1 class="main-title">T.V.A.</h1>
    </div>
	<div id="banniere">
		<ul class="menu">
			<li class="menu-item"><a href="../index.html">Accueil</a></li>
			<li class="menu-item"><a>L'équipe</a>
				<ul class="sous-menu">
					<li class="sous-menu-item"><a href="../loic/loicCV.html">Loic
							Tramis</a></li>
					<li class="sous-menu-item"><a href="../nathan/nathanCV.html">Nathan
							Valentin</a></li>
					<li class="sous-menu-item"><a href="../karim/karimCV.html">Karim
							Ammour</a></li>
				</ul></li>
		</ul>
	</div>
	<!-- below the main menu (for navigation) -->
	<div>
		<h1 class="name">Nathan Valentin</h1>
		<p class="subname">Etudiant et co-fondateur de <strong>TVA</strong>	</p>
	</div>
	<div id="sous-menu">
		<ul class="menu-liste">
			<li><a href="nathanCV.html">Présentation</a></li>
			<li><a href="nathanPF.html">Points forts</a></li>
			<li><a href="nathanReal.html">Réalisations</a></li>
		</ul>
	</div>
	<div>
		<h1>R&eacute;alisations</h1>
		<h2>Agr&eacute;gateur de donn&eacute;es g&eacute;ographiques</h2>
		<p>Ce logiciel a &eacute;t&eacute; conçu cette ann&eacute;e. Il
			consiste &agrave; retrouver les informations g&eacute;n&eacute;rales
			d'un pays recherch&eacute;. Il est disponible en mode console et en
			mode graphique.</p>
		<div>
			<p>
				<br />
			</p>
		</div>
		<h2>Dark Castle Shell</h2>
		<p>Il s'agit d'un projet que nous avons effectu&eacute;
			l'ann&eacute;e derni&egrave;re. Le but &eacute;tait de cr&eacute;er
			un mini jeu de type rpg en mode console avec des pi&egrave;ges, des
			monstres, des tr&eacute;sors, etc et nous avons d&eacute;cid&eacute;
			de nommer notre jeu Dark Castle Shell, pour faire un clin d'oeil au
			jeu de plateforme initialement sorti dans les ann&eacute;es 80. Le
			but de notre jeu &eacute;tait simple. Trouver les cl&eacute;s pour
			ouvrir les coffres (qu'il fallait &eacute;galement chercher) en
			&eacute;vitant les pi&egrave;ges et les monstres. Mais tel que l'on
			voit le rendu, le vrai d&eacute;fi pour le joueur est surtout de
			savoir ou se trouve son personnage. Et vous saurez-vous o&ugrave; il
			se cache?</p>
		<div>
			<p>
				<a href="../img/Projet.png"><img src="../img/tn_Projet.png"
					alt="Trouvez votre personnage" title="Cliquer pour agrandir" /></a>
			</p>
		</div>

		<h2>Snake Adventure</h2>
		<p>Snake Adventure fait partie de nos projets que l'on pourrait
			appeler projet eclair. C'est &agrave; dire que l'on doit cr&eacute;er
			tout un mini jeu et en 24 heures. On est donc parti dans une sorte de
			snake et en 3d. Dans Snake, le personnage est un serpent qui doit
			r&eacute;cup&eacute;rer des mini blocs afin de grandir. Mais dans
			notre jeu, grace au logiciel Unity, nous avons nous m&ecirc;me
			mod&eacute;lis&eacute; notre serpent, qui malheureusement ne grandira
			pas lorsqu'il prendra ses capsules (dans notre jeu, le serpent
			r&eacute;cup&eacute;re des capsules). Nous avons
			mod&eacute;lis&eacute; le terrain, le personnage, son abri et les
			capsules, ensuite nous avons cr&eacute;&eacute; les scripts, le tout
			en 24 heures, et apr&egrave;s plusieurs tests, ce jeu est
			d&eacute;sormais jouable sur OS X. Quoique le jeu n'a qu'un seul
			niveau et nous nous f&eacute;licitons pour l'originalit&eacute; de
			l'&eacute;cran de fin qui n'est autre que la texture de notre
			serpent.</p>
		<div>
			<p>
				<a href="../img/Projet eclair 1.png"><img
					src="../img/tn_Projet eclair 1.png" alt="Snake Adventure depart"
					title="Cliquer pour agrandir" /></a>
			</p>
		</div>
	</div>
	<div>
		<p class="menu"><a href="#banniere">haut de page</a></p>
	</div>
</body>
</html>